const equipmentData = [
  {
    id: 1,
    data: ['【1】SHARPY Plus', '148', '2', '1', '3', ''],
  },
  {
    id: 2,
    data: ['【2】ROBIN T2 Profile', '26', '3', '1', '4', ''],
  },
  {
    id: 3,
    data: ['【3】ROBIN Pointe_Ω', '198', '18', '2', '20', ''],
  },
  {
    id: 4,
    data: ['', '', '', '', '', ''],
  },
  {
    id: 5,
    data: ['ハイエース', '1', '1', '0', '1', ''],
  },
  {
    id: 6,
    data: ['11t', '1', '1', '0', '1', ''],
  },
  {
    id: 7,
    data: ['11t', '1', '1', '0', '1', ''],
  },
];

const dateData = [
  {
    id: 1,
    data: ['148', '148', '145', '145', '145', '145', '145', '145', '145', '145', '145'],
  },
  {
    id: 2,
    data: ['26', '26', '22', '22', '22', '22', '22', '22', '22', '22', '22'],
  },
  {
    id: 3,
    data: ['198', '178', '178', '178', '178', '178', '178', '178', '178', '178', '178'],
  },
  {
    id: 4,
    data: ['', '', '', '', '', '', '', '', '', '', ''],
  },
  {
    id: 5,
    data: ['', '出庫', '', '', '', '', '', '', '', '', ''],
  },
  {
    id: 6,
    data: ['', '', '出庫', '', '', '', '', '', '', '', ''],
  },
  {
    id: 7,
    data: ['', '', '', '', '', '', '', '', '', '', '返却'],
  },
];

const equipmentHeader = ['機材名・車両名', '全', '受注数', '予備数', '合計', ''];

const dateHeader = ['11/1', '11/2', '11/3', '11/4', '11/5', '11/6', '11/7', '11/8', '11/9', '11/10', '11/11'];

const equipmentWidths = ['150px', '65px'];

const dateWidths = ['80px', '80px'];

export { dateData, dateHeader, dateWidths, equipmentData, equipmentHeader, equipmentWidths };
